## Plan Result (nonprod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 15 to add, 4 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_backup_policy_vm.vm-backup-policy
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-confluence-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-confluence-04&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-crowd-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-gluster-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-gluster-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-gluster-03&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-jira-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-jira-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-jira-03&#34;]
  * azurerm_postgresql_flexible_server.atlassian-flex-server-v15[0]
  * azurerm_postgresql_flexible_server_database.v15-database[&#34;confluence&#34;]
  * azurerm_postgresql_flexible_server_database.v15-database[&#34;jira&#34;]
  * terraform_data.atlassian-flex-server-v15[&#34;confluence&#34;]
  * terraform_data.atlassian-flex-server-v15[&#34;jira&#34;]
* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_flexible_server.atlassian-flex-server
  * azurerm_postgresql_server.atlassian-server[0]
* Delete
  * azurerm_data_protection_backup_policy_postgresql_flexible_server.postgres-backup-policy[0]
  * azurerm_data_protection_backup_vault.postgres-backup-vault[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_backup_policy_vm.vm-backup-policy will be created
  + resource "azurerm_backup_policy_vm" "vm-backup-policy" {
      + id                             = (known after apply)
      + instant_restore_retention_days = 2
      + name                           = "atlassian-nonprod-vm-backup-policy"
      + policy_type                    = "V1"
      + recovery_vault_name            = "atlassian-nonprod-rsv"
      + resource_group_name            = "atlassian-nonprod-rg"
      + timezone                       = "UTC"

      + backup {
          + frequency = "Daily"
          + time      = "02:30"
        }

      + retention_daily {
          + count = 10
        }

      + retention_monthly {
          + count             = 7
          + include_last_days = false
          + weekdays          = [
              + "Sunday",
            ]
          + weeks             = [
              + "First",
              + "Last",
            ]
        }

      + retention_weekly {
          + count    = 42
          + weekdays = [
              + "Sunday",
            ]
        }

      + retention_yearly {
          + count             = 77
          + include_last_days = false
          + months            = [
              + "January",
            ]
          + weekdays          = [
              + "Sunday",
            ]
          + weeks             = [
              + "Last",
            ]
        }
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-confluence-02"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-nonprod-rsv"
      + resource_group_name = "atlassian-nonprod-rg"
      + source_vm_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-confluence-02"
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-confluence-04"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-nonprod-rsv"
      + resource_group_name = "atlassian-nonprod-rg"
      + source_vm_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-confluence-04"
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-crowd-01"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-nonprod-rsv"
      + resource_group_name = "atlassian-nonprod-rg"
      + source_vm_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-crowd-01"
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-gluster-01"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-nonprod-rsv"
      + resource_group_name = "atlassian-nonprod-rg"
      + source_vm_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-01"
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-gluster-02"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-nonprod-rsv"
      + resource_group_name = "atlassian-nonprod-rg"
      + source_vm_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-02"
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-gluster-03"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-nonprod-rsv"
      + resource_group_name = "atlassian-nonprod-rg"
      + source_vm_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-03"
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-jira-01"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-nonprod-rsv"
      + resource_group_name = "atlassian-nonprod-rg"
      + source_vm_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-01"
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-jira-02"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-nonprod-rsv"
      + resource_group_name = "atlassian-nonprod-rg"
      + source_vm_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-02"
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-jira-03"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-nonprod-rsv"
      + resource_group_name = "atlassian-nonprod-rg"
      + source_vm_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-03"
    }

  # azurerm_data_protection_backup_policy_postgresql_flexible_server.postgres-backup-policy[0] will be destroyed
  # (because azurerm_data_protection_backup_policy_postgresql_flexible_server.postgres-backup-policy is not in configuration)
  - resource "azurerm_data_protection_backup_policy_postgresql_flexible_server" "postgres-backup-policy" {
      - backup_repeating_time_intervals = [
          - "R/2025-04-20T03:30:00+00:00/P1D",
        ] -> null
      - id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DataProtection/backupVaults/atlassian-nonprod-postgres/backupPolicies/atlassian-nonprod-postgres-backup-policy" -> null
      - name                            = "atlassian-nonprod-postgres-backup-policy" -> null
      - vault_id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DataProtection/backupVaults/atlassian-nonprod-postgres" -> null
        # (1 unchanged attribute hidden)

      - default_retention_rule {
          - life_cycle {
              - data_store_type = "VaultStore" -> null
              - duration        = "P1W" -> null
            }
        }
    }

  # azurerm_data_protection_backup_vault.postgres-backup-vault[0] will be destroyed
  # (because azurerm_data_protection_backup_vault.postgres-backup-vault is not in configuration)
  - resource "azurerm_data_protection_backup_vault" "postgres-backup-vault" {
      - cross_region_restore_enabled = false -> null
      - datastore_type               = "VaultStore" -> null
      - id                           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DataProtection/backupVaults/atlassian-nonprod-postgres" -> null
      - immutability                 = "Disabled" -> null
      - location                     = "uksouth" -> null
      - name                         = "atlassian-nonprod-postgres" -> null
      - redundancy                   = "ZoneRedundant" -> null
      - resource_group_name          = "atlassian-nonprod-rg" -> null
      - retention_duration_in_days   = 14 -> null
      - soft_delete                  = "On" -> null
      - tags                         = {
          - "application"  = "atlassian"
          - "builtFrom"    = "hmcts/atlassian-infrastructure"
          - "businessArea" = "Cross-Cutting"
          - "environment"  = "staging"
        } -> null

      - identity {
          - principal_id = "fcabc905-9fca-469a-b5c2-6d95df21b9c4" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
        name                            = "atlasssian-nonprod-kv"
        tags                            = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server"
        name                              = "atlassian-nonprod-flex-server"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server-v15[0] will be created
  + resource "azurerm_postgresql_flexible_server" "atlassian-flex-server-v15" {
      + administrator_login           = (sensitive value)
      + administrator_password        = (sensitive value)
      + administrator_password_wo     = (write-only attribute)
      + auto_grow_enabled             = false
      + backup_retention_days         = 7
      + delegated_subnet_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-int-nonprod-vnet/subnets/atlassian-int-subnet-postgres-flex"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "atlassian-nonprod-flex-server-v15"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com"
      + public_network_access_enabled = false
      + resource_group_name           = "atlassian-nonprod-rg"
      + sku_name                      = "MO_Standard_E8s_v3"
      + storage_mb                    = 262144
      + storage_tier                  = "P15"
      + tags                          = {
          + "application"  = "atlassian"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + version                       = "15"
      + zone                          = "1"

      + authentication {
          + active_directory_auth_enabled = false
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # azurerm_postgresql_flexible_server_database.v15-database["confluence"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "v15-database" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "confluence-db-nonprod"
      + server_id = (known after apply)
    }

  # azurerm_postgresql_flexible_server_database.v15-database["jira"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "v15-database" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "jira-db-nonprod"
      + server_id = (known after apply)
    }

  # azurerm_postgresql_server.atlassian-server[0] will be updated in-place
  ~ resource "azurerm_postgresql_server" "atlassian-server" {
      ~ administrator_login_password            = (sensitive value)
        id                                      = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server"
        name                                    = "atlassian-nonprod-server"
        tags                                    = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (17 unchanged attributes hidden)
    }

  # terraform_data.atlassian-flex-server-v15["confluence"] will be created
  + resource "terraform_data" "atlassian-flex-server-v15" {
      + id               = (known after apply)
      + triggers_replace = [
          + (known after apply),
          + "https://atlasssian-nonprod-kv.vault.azure.net/secrets/confluence-db-nonprod-postgres-password/27dbe290bd5a4b629f8a5cc4096b33d9",
          + "https://atlasssian-nonprod-kv.vault.azure.net/secrets/confluence-db-nonprod-postgres-username/6c585d3ebb284b52822375f326a01ed1",
        ]
    }

  # terraform_data.atlassian-flex-server-v15["jira"] will be created
  + resource "terraform_data" "atlassian-flex-server-v15" {
      + id               = (known after apply)
      + triggers_replace = [
          + (known after apply),
          + "https://atlasssian-nonprod-kv.vault.azure.net/secrets/jira-db-nonprod-postgres-password/d43e7690b13a491c83359558c1b7f614",
          + "https://atlasssian-nonprod-kv.vault.azure.net/secrets/jira-db-nonprod-postgres-username/82c4e4a604864795979c11cde79787cf",
        ]
    }

Plan: 15 to add, 4 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":100,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->